#### learning Pandas (3)

#### 9. Converting String into numbers(type-casting)

In [2]:
import pandas as pd
df = pd.DataFrame({'col_a' : ['1','2','3','4','5'],'col_b' : [6,7,8,9,10]})
df
df.dtypes

col_a    object
col_b     int64
dtype: object

In [9]:
df.astype({'col_a' :'int64', 'col_b' : 'int64' }).dtypes

col_a    int64
col_b    int64
dtype: object

#### 10. Reduce dataFrame Size

In [11]:
import seaborn as sns 
df = sns.load_dataset('titanic')
df.shape

(891, 15)

In [12]:
df.sample(frac=0.2).shape

(178, 15)

#### 11. split dataFrames into two Subset

In [17]:
import seaborn as sns
import pandas as pd 
df = sns.load_dataset('titanic')
df.head(3)
len(df)

891

In [27]:

#we use From random import random 
from random import random
boat_01 = df.sample(frac=0.5, random_state=1)
boat_01.shape

(446, 15)

In [28]:
boat_02 = df.drop(boat_01.index)    #Droping boat_01 from the Overall df
boat_02.shape

(445, 15)

In [30]:
boat_01.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [31]:
boat_02.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [32]:
len(boat_02) + len(boat_01)

891

#### 12. joining the Two DataSets

In [33]:
df1 = pd.concat([boat_01, boat_02]) #this will joined the two kashties
df1.shape

(891, 15)